"""Константы для библиотеки"""

# Списки для генерации случайных книг
TITLES = [
    "Война и мир",
    "1984",
    "Мастер и Маргарита",
    "Преступление и наказание",
    "Гарри Поттер",
    "Евгений Онегин",
    "Анна Каренина",
    "Идиот",
    "Отцы и дети",
    "Герой нашего времени"
]

AUTHORS = [
    "Толстой",
    "Оруэлл",
    "Булгаков",
    "Достоевский",
    "Роулинг",
    "Пушкин",
    "Тургенев",
    "Лермонтов"
]

GENRES = [
    "Роман",
    "Антиутопия",
    "Фантастика",
    "Детектив",
    "Поэзия",
    "Классика",
    "Приключения"
]

NARRATORS = [
    "Безруков",
    "Козаков",
    "Смоктуновский",
    "Табаков"
]

FILE_FORMATS = ["PDF", "EPUB", "FB2", "MOBI"]

COVER_TYPES = ["мягкая", "твёрдая"]
